results.txt
siege docker-ce 

rm /usr/local/bin/docker-compose
suppression de
curl -L "https://github.com/docker/compose/releases/download/1.23.1/docker-compose-$(uname -s)-$(uname -m)" -o /usr/local/bin/docker-compose


siege -r once -c 1 -f urls-haproxy.txt

Transactions:                  12010 hits
Availability:                 100.00 %
Elapsed time:                 427.53 secs
Data transferred:            1200.83 MB
Response time:                  0.02 secs
Transaction rate:              28.09 trans/sec
Throughput:                     2.81 MB/sec
Concurrency:                    0.66
Successful transactions:       12009
Failed transactions:               0
Longest transaction:            0.42
Shortest transaction:           0.00

siege -r once -c 1 -f urls-hitch.txt
Transactions:                  12010 hits
Availability:                 100.00 %
Elapsed time:                 423.64 secs
Data transferred:            1200.83 MB
Response time:                  0.02 secs
Transaction rate:              28.35 trans/sec
Throughput:                     2.83 MB/sec
Concurrency:                    0.67
Successful transactions:       12009
Failed transactions:               0
Longest transaction:            0.43
Shortest transaction:           0.00

siege -r once -c 1 -f urls-nginx.txt
Transactions:                  12010 hits
Availability:                 100.00 %
Elapsed time:                 418.81 secs
Data transferred:            1200.83 MB
Response time:                  0.02 secs
Transaction rate:              28.68 trans/sec
Throughput:                     2.87 MB/sec
Concurrency:                    0.68
Successful transactions:       12009
Failed transactions:               0
Longest transaction:            0.50
Shortest transaction:           0.00

siege -r once -c 50 -f urls-haproxy.txt
Transactions:                 600500 hits
Availability:                 100.00 %
Elapsed time:                4335.51 secs
Data transferred:           60041.70 MB
Response time:                  0.35 secs
Transaction rate:             138.51 trans/sec
Throughput:                    13.85 MB/sec
Concurrency:                   48.14
Successful transactions:      600450
Failed transactions:               0
Longest transaction:            5.43
Shortest transaction:           0.00

siege -r once -c 50 -f urls-hitch.txt
Transactions:                 600500 hits
Availability:                 100.00 %
Elapsed time:                4616.91 secs
Data transferred:           60041.70 MB
Response time:                  0.37 secs
Transaction rate:             130.07 trans/sec
Throughput:                    13.00 MB/sec
Concurrency:                   48.33
Successful transactions:      600450
Failed transactions:               0
Longest transaction:            5.72
Shortest transaction:           0.00
 
siege -r once -c 50 -f urls-nginx.txt
Transactions:                 600500 hits
Availability:                 100.00 %
Elapsed time:                1541.23 secs
Data transferred:           60041.70 MB
Response time:                  0.12 secs
Transaction rate:             389.62 trans/sec
Throughput:                    38.96 MB/sec
Concurrency:                   45.22
Successful transactions:      600450
Failed transactions:               0
Longest transaction:            1.08
Shortest transaction:           0.00


siege -r once -c 100 -f urls-haproxy.txt
Transactions:                1201000 hits
Availability:                 100.00 %
Elapsed time:                8857.93 secs
Data transferred:          119961.18 MB
Response time:                  0.72 secs
Transaction rate:             135.58 trans/sec
Throughput:                    13.54 MB/sec
Concurrency:                   97.99
Successful transactions:     1200900
Failed transactions:               0
Longest transaction:           85.54
Shortest transaction:           0.00

siege -r once -c 100 -f urls-hitch.txt
Transactions:                1201000 hits
Availability:                 100.00 %
Elapsed time:                9287.32 secs
Data transferred:          120083.39 MB
Response time:                  0.76 secs
Transaction rate:             129.32 trans/sec
Throughput:                    12.93 MB/sec
Concurrency:                   98.24
Successful transactions:     1200900
Failed transactions:               0
Longest transaction:           34.52
Shortest transaction:           0.00

siege -r once -c 100 -f urls-nginx.txt
The server is now under siege...
Transactions:                1201000 hits
Availability:                 100.00 %
Elapsed time:                2934.98 secs
Data transferred:          120083.39 MB
Response time:                  0.23 secs
Transaction rate:             409.20 trans/sec
Throughput:                    40.91 MB/sec
Concurrency:                   94.98
Successful transactions:     1200900
Failed transactions:               0
Longest transaction:            5.43
Shortest transaction:           0.00

No cache
siege -g http://docker.localhost:80/index.html
[alert] Zip encoding disabled; siege requires zlib support to enable it
HEAD /index.html HTTP/1.0
Host: docker.localhost
Accept: */*
User-Agent: Mozilla/5.0 (pc-x86_64-linux-gnu) Siege/4.0.2
Connection: close


HTTP/1.1 200 OK
Server: nginx/1.15.7
Date: Thu, 06 Dec 2018 13:05:43 GMT
Content-Type: text/html
Content-Length: 51474
Connection: close
Cache-Control: no-store, no-cache, must-revalidate, proxy-revalidate, max-age=0
Accept-Ranges: bytes

siege -r once -c 50 -f urls-haproxy.txt
Transactions:                 600500 hits
Availability:                 100.00 %
Elapsed time:                4347.01 secs
Data transferred:           60041.70 MB
Response time:                  0.35 secs
Transaction rate:             138.14 trans/sec
Throughput:                    13.81 MB/sec
Concurrency:                   48.14
Successful transactions:      600450
Failed transactions:               0
Longest transaction:            5.45
Shortest transaction:           0.00

siege -r once -c 50 -f urls-hitch.txt
Transactions:                 600500 hits
Availability:                 100.00 %
Elapsed time:                4623.49 secs
Data transferred:           60041.70 MB
Response time:                  0.37 secs
Transaction rate:             129.88 trans/sec
Throughput:                    12.99 MB/sec
Concurrency:                   48.32
Successful transactions:      600450
Failed transactions:               0
Longest transaction:            5.46
Shortest transaction:           0.00

siege -r once -c 50 -f urls-nginx.txt
Transactions:                 600500 hits
Availability:                 100.00 %
Elapsed time:                1544.63 secs
Data transferred:           60041.70 MB
Response time:                  0.12 secs
Transaction rate:             388.77 trans/sec
Throughput:                    38.87 MB/sec
Concurrency:                   45.23
Successful transactions:      600450
Failed transactions:               0
Longest transaction:            5.06
Shortest transaction:           0.00